---
type: ExternalResourceServerUtils
namespace: Autodesk.Revit.DB
version: 2024
members: 6
tags: [revit-api, class]
---

# ExternalResourceServerUtils

`Autodesk.Revit.DB.ExternalResourceServerUtils` · Revit 2024 · 6 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | IsValidShortName | 2015 | `public static bool IsValidShortName ( Guid serverId , string serverName )` |
| Method | ServerSupportsAssemblyCodeData | 2015 | `public static bool ServerSupportsAssemblyCodeData ( ExternalResourceReference extRef )` |
| Method | ServerSupportsCADLinks | 2018 | `public static bool ServerSupportsCADLinks ( ExternalResourceReference extRef )` |
| Method | ServerSupportsIFCLinks | 2018 | `public static bool ServerSupportsIFCLinks ( ExternalResourceReference extRef )` |
| Method | ServerSupportsKeynotes | 2015 | `public static bool ServerSupportsKeynotes ( ExternalResourceReference extRef )` |
| Method | ServerSupportsRevitLinks | 2015 | `public static bool ServerSupportsRevitLinks ( ExternalResourceReference extRef )` |